/*

TODO:

ОБОВЯЗКОВО!

- додати рандомний спавн збирального предмета (маленький вогник), реалізувати його на всіх платформах крім вбивчих та підкидальних
- зміна кольору поламаної платформи при контакті (буде темніти)
- додати кондішн стрибка та повісити якусь дію (може реально якийсь партікл відмалювати, хз)
- кондішн при створенні платформи та можливість навішувати дії при створенні платформи... треба думати




доробити:

- кількість платформ на одному рівні Х засунути в окремий метод
    підвязате його до генератора позиції, щоб більша варіативність по висоті була,
    бо бісить, що платформи іноді одна на одній спавняться
- в генераторі позицій затиснути Y, на всяк випадок, хай буде




додатково мої власні цілі:

- додати анімацію знищення гравця
- переробити анімацію стрибка
    хай не щуриться, а навпаки посміхаєься
    також додати варіації типу стрибок вгору, та падіння
    МОЖЛИВО ще додати варіації саме як підстрибує, та приземлюється
- реалізувати інтродакшн для платформ, тобто початкову систему складності
- систему різної висоти платформ також зациклити, тільки мінімальний поріг рандомізувати
    і якщо рандомайз спавну кожні 10 рівнів, то рандомайз висоти хай буде кожні 40 рівнів
    і все це тільки ПІСЛЯ включення рандомайзу
- реалізувати слизькі платформи (гравець коли буде стояти - буде скользити в ту сторону в яку дивиться, 
    і доволі швидко, тож затримуватись не варто)
- реалізувати платформи, що рухаються

*/

