using UnityEngine;

namespace OIMOD.Core.GameMech
{
/*

TODO:

Створити префаб платформи:
Створити новий вид платформ через успадкування, платформа може виконувати будьякі нестандартні дії, наприклад зникати під гравцем через кілька секунд.


Розширити базовий генератор (приклад у проєкті)
Створення декількох платформ на одній висоті (в одній позиції по осі Y)
Випадкова платформа береться зі списку замість єдиної заданої в інспекторі.



ЗРОБЛЕНО PT 09:

+ Кожна платформа повинна отримати свою мету (гравця) для перемикання колайдерів.
+ Реалізувати скрипт вимкнення / увімкнення колайдера залежно від поточної висоти гравця


+Написати генератор платформ, який вміє створювати платформи за префабом через певний крок на вказану кількість кроків.
+Жива генерація платформ (створюються і видаляються по ходу гри)
+Позиціонування платформ по-ширині екрана (задати діапазон в інспекторі)
+Реалізувати спавн платформ як у дудлі (у групі платформ на одній висоті кожна платформа трохи змінює висоту під час спавну в заданому діапазоні)


PT 08

+ Створити скрипт переміщення камери за гравцем.
+ Додати поворот персонажа залежно від напрямку руху (наприклад віддзеркалювати спрайт або інвертувати розмір

*/
}

