/*

TODO:

- треба шось зробить з цим бісячим багом, що інколи не зараховує чи гравець приземлився чи ні
    через це гравець застряє в положенні "в стрибку", або анімація починає ковзати десь в перехідному проміжку між "в стрибку" "в падінні"
    також є такий момент, що не завжди навіть зчитує дотик до платформи (особливо помітно на прикладі зломаних платформ)
    проблема дуже очевидна, коли включений автострибок

- зробити якусь прикольну паралакс текстуру на передній та задній план
    можливо хмаринки, чи шось таке

- також можна затемнити фон, коли гра перейде в стадію рандомної генерації


*/

